var provinces = 
[[1,'北京'],[2,'上海'],[3,'天津市'],[4,'河北省'],[5,'山西省'],[6,'内蒙古自治区']
,[7,'辽宁省'],[8,'吉林省'],[9,'黑龙江省'],[10,'江苏省'],[11,'浙江省'],[12,'安徽省']
,[13,'福建省'],[14,'江西省'],[15,'山东省'],[16,'河南省'],[17,'湖北省'],[18,'湖南省']
,[19,'广东省'],[20,'广西自治区'],[21,'海南省'],[22,'重庆市'],[23,'四川省'],[24,'贵州省']
,[25,'云南省'],[26,'西藏自治区'],[27,'陕西省'],[28,'甘肃省'],[29,'青海省'],[30,'宁夏自治区']
,[31,'新疆自治区'],[32,'香港特别行政区'],[33,'澳门特别行政区'],[34,'台湾省']];


var cities = new Array();
cities[1] = [[12,'东城'],[13,'西城'],[14,'崇文'],[15,'海淀'],[16,'宣武'],[17,'朝阳'],[18,'丰台'],[19,'通州'],[110,'石景山'],[111,'昌平'],[112,'房山'],[113,'大兴'],[114,'怀柔'],[115,'门头沟'],[116,'密云'],[117,'平谷'],[118,'顺义'],[119,'燕郊'],[120,'延庆'],[11,'其他']];    
cities[2] = [[21,'宝山'],[22,'长宁'],[23,'闸北'],[24,'崇明'],[25,'奉贤'],[26,'虹口'],[27,'黄浦'],[28,'嘉定'],[29,'金山'],[210,'静安'],[211,'卢湾'],[212,'闵行'],[213,'浦东'],[214,'普陀'],[215,'青浦'],[216,'松江'],[217,'徐汇'],[218,'杨浦'],[219,'其他']];
cities[3] = [[31,'北辰'],[32,'宝坻'],[33,'武清'],[34,'滨海新区'],[35,'东丽'],[36,'河北'],[37,'河东'],[38,'和平'],[39,'红桥'],[310,'河西'],[311,'静海'],[312,'津南'],[313,'蓟县'],[314,'宁河'],[315,'南开'],[316,'西青'],[317,'其他']];
//河北省
cities[4] = [[41,'石家庄'],[42,'张家口市'],[43,'承德市'],[44,'秦皇岛市'],[45,'唐山市'],[46,'廊坊市'],[47,'保定市'],[48,'沧州市'],[49,'衡水市'],[410,'邢台市'],[411,'邯郸市']];
//山西省
cities[5] = [[51,'太原市'],[52,'大同市'],[53,'朔州市'],[54,'阳泉市'],[55,'长治市'],[56,'晋城市'],[57,'忻州市'],[58,'吕梁市'],[59,'晋中市'],[510,'临汾市'],[511,'运城市']];
//内蒙古自治区
cities[6] = [[61,'呼和浩特'],[62,'包头市'],[63,'乌海市'],[64,'赤峰市'],[65,'呼伦贝尔盟'],[66,'兴安盟'],[67,'哲里木盟'],[68,'锡林郭勒盟'],[69,'乌兰察布盟'],[610,'鄂尔多斯市'],[611,'巴彦淖尔盟'],[612,'阿拉善盟']];
//辽宁省
cities[7] = [[71,'沈阳市'],[72,'朝阳市'],[73,'阜新市'],[74,'铁岭市'],[75,'抚顺市'],[76,'本溪市'],[77,'辽阳市'],[78,'鞍山市'],[79,'丹东市'],[710,'大连市'],[711,'营口市'],[712,'盘锦市'],[713,'锦州市'],[714,'葫芦岛市']];
//吉林省
cities[8] = [[81,'长春市'],[812,'白城市'],[813,'松原市'],[814,'吉林市'],[815,'四平市'],[816,'辽源市'],[817,'通化市'],[818,'白山市'],[819,'延边朝鲜族自治州']];
//黑龙江省[91,'上海']
cities[9] = [[92,'哈尔滨市'], [93,'齐齐哈尔市'], [94,'黑河市'],   [95,'大庆市'],  [96,'伊春市'], [97,'鹤岗市'], [98,'佳木斯市'], [99,'双鸭山市'], [910,'七台河市'], [911,'鸡西市'], [912,'牡丹江市'], [913,'绥化市'], [914,'大兴安']];
//江苏省[101,'上海']
cities[10] = [[101,'南京市'], [102,'徐州市'],   [103,'连云港'],   [104,'宿迁市'], [105,'淮阴市'], [106,'盐城市'], [107,'扬州市'], [108,'泰州市'], [109,'南通市'], [1010,'镇江市'], [1011,'常州市'], [1012,'无锡市'], [1013,'苏州市']];
//浙江省[111,'上海']
cities[11] = [[111,'杭州市'], [112,'湖州市'],   [113,'嘉兴市'],   [114,'舟山市'], [115,'宁波市'], [116,'绍兴市'], [117,'金华市'], [118,'台州市'], [119,'温州市'], [1110,'丽水市']];
//安徽省[121,'上海'],
cities[12] = [[121,'合肥市'], [122,'宿州市'],   [123,'淮北市'],   [124,'阜阳市'], [125,'蚌埠市'], [126,'淮南市'], [127,'滁州市'], [128,'马鞍山市'], [129,'芜湖市'], [1210,'铜陵市'], [1211,'安庆市'], [1212,'黄山市'], [1213,'六安市'], [1214,'巢湖市'], [1215,'池州市'], [1216,'宣城市']];
//福建省[131,'上海']
cities[13] = [[131,'福州市'], [132,'南平市'],   [133,'三明市'],   [134,'莆田市'], [135,'泉州市'],   [136,'厦门市'],   [137,'漳州市'], [138,'龙岩市'], [139,'宁德市']];
//江西省[141,'福州市']                                                                        
cities[14] = [[141,'南昌市'], [142,'九江市'],   [143,'景德镇市'], [144,'鹰潭市'], [145,'新余市'],   [146,'萍乡市'],   [147,'赣州市'], [148,'上饶市'], [149,'抚州市'], [1410,'宜春市'], [1411,'吉安市']];
       
//山东省[151,'南昌市']                                                                          
cities[15] = [[151,'济南市'], [152,'聊城市'],   [153,'德州市'],   [154,'东营市'], [155,'淄博市'],   [156,'潍坊市'],   [157,'烟台市'], [158,'威海市'], [159,'青岛市'], [1510,'日照市'], [1511,'临沂市'], [1512,'枣庄市'], [1513,'济宁市'], [154,'泰安市'], [155,'莱芜市'], [156,'滨州市'], [157,'菏泽市']];
//河南省[151,'济南市']                                                                                                                                      
cities[16] = [[151,'郑州市'], [152,'三门峡市'], [153,'洛阳市'],   [154,'焦作市'], [155,'新乡市'],   [156,'鹤壁市'],   [157,'安阳市'], [158,'濮阳市'], [159,'开封市'], [1510,'商丘市'], [1511,'许昌市'], [1512,'漯河市'], [1513,'平顶山市'], [154,'南阳市'], [155,'信阳市'], [156,'省直辖行政单位'], [157,'周口市'], [158,'驻马店市']];
//湖北省[171,'郑州市']                                                                                                                                
cities[17] = [[171,'武汉市'], [172,'十堰市'],   [173,'襄攀市'],   [174,'荆门市'], [175,'孝感市'],   [176,'黄冈市'],   [177,'鄂州市'], [178,'黄石市'], [179,'咸宁市'], [1710,'荆州市'], [1711,'宜昌市'], [1712,'省直辖行政单位'], [1713,'恩施土家族苗族自治州'], [1714,'襄樊市']];
//湖南省[181,'上海']                                                                                                                                               
cities[18] = [[181,'长沙市'], [182,'张家界市'], [183,'常德市'],   [184,'益阳市'], [185,'岳阳市'],   [186,'株洲市'],   [187,'湘潭市'], [188,'衡阳市'], [189,'郴州市'], [1810,'永州市'], [1811,'邵阳市'], [1812,'怀化市'], [1813,'娄底市'], [1814,'湘西土家族苗族自治州']];
//广东省[191,'上海']                                                                                                                                              
cities[19] = [[191,'广州市'], [192,'清远市'],   [193,'韶关市'],   [194,'河源市'], [195,'梅州市'],   [196,'潮州市'],   [197,'汕头市'], [198,'揭阳市'], [199,'汕尾市'], [1910,'惠州市'], [1911,'东莞市'], [1912,'深圳市'], [1913,'珠海市'], [1914,'江门市'], [1915,'佛山市'], [1916,'肇庆市'], [1917,'云浮市'], [1918,'阳江市'], [1919,'茂名市'], [1920,'湛江市']];
//广西自治区                                                                                 
cities[20] = [[201,'南宁市'], [202,'桂林市'],   [203,'柳州市'],   [204,'梧州市'], [205,'贵港市'],   [206,'玉林市'],   [207,'钦州市'], [208,'北海市'], [209,'防城港市'], [2010,'南宁市'], [2011,'百色市'], [2012,'河池市'], [2013,'柳州市'], [2014,'贺州市']];
//海南省[211,'上海']                                                                           
cities[21] = [[211,'海口市'], [212,'三亚市'],   [213,'省直辖行']];
//重庆市
cities[22] = [['北碚','北碚'],['北部新区','北部新区'],['巴南','巴南'],['大渡口','大渡口'],['高新区','高新区'],['江北','江北'],['九龙坡','九龙坡'],['南岸','南岸'],['沙坪坝','沙坪坝'],['渝北','渝北'],['渝中','渝中'],['其他','其他']];                  
//四川省[231,'上海']                             
cities[23] = [[231,'成都市'], [232,'广元市'],   [233,'绵阳市'], [234,'德阳市'],   [235,'南充市'],   [236,'广安市'],   [237,'遂宁市'], [238,'内江市'], [239,'乐山市'], [2310,'自贡市'], [2311,'泸州市'], [2312,'宜宾市'], [2313,'攀枝花市'], [2314,'巴中市'], [2315,'达川市'], [2316,'资阳市'], [2317,'眉山市'], [2318,'雅安市'], [2319,'阿坝藏族羌族自治州'], [2320,'甘孜藏族自治州'], [2321,'凉山彝族自治州']];
//贵州省[241,'上海']                                            
cities[24] = [[241,'贵阳市'], [242,'六盘水市'], [243,'遵义市'], [244,'毕节市'], [245,'铜仁市'], [246,'安顺市'], [247,'黔东南苗族侗族自治区'], [248,'黔南布依族苗族自治区'], [249,'黔西南布依族苗族自治州']];
//云南省[251,'上海']                                            
cities[25] = [[251,'昆明市'], [252,'曲靖市'],   [253,'玉溪市'], [254,'丽江市'], [255,'昭通市'], [256,'思茅市'], [257,'临沧市'], [258,'保山市'], [259,'德宏傣族景颇族自治州'], [2510,'怒江僳僳族自治州'], [2511,'迪庆藏族自治州'], [2512,'大理白族自治州'], [2513,'楚雄彝族自治州'], [2514,'红河哈尼族自治州'], [2515,'文山壮族自治州'], [2516,'西双版纳傣族自治州']];
//西藏自治区[261,'上海']                                        
cities[26] = [[261,'拉萨市'], [262,'那曲市'],[263,'昌都市'],[264,'林芝市'], [265,'山南市'], [266,'日喀则'],   [267,'阿里市']];
//陕西省[271,'上海']                                      
cities[27] = [[271,'西安市'], [272,'延安市'],   [273,'铜川市'], [274,'渭南市'],   [275,'咸阳市'],   [276,'宝鸡市'],   [277,'汉中市'], [278,'榆林市'], [279,'商洛市'], [2710,'安康市']];
//甘肃省[281,'上海']                                   
cities[28] = [[281,'兰州市'], [282,'嘉峪关市'], [283,'金昌市'], [284,'白银市'],   [285,'天水市'],   [286,'酒泉市'], [287,'张掖市'], [288,'武威市'], [289,'庆阳市'], [2810,'平凉市'], [2811,'定西市'], [2812,'陇南市'], [2813,'临夏回族自治州'], [2814,'甘南藏族自治州']];
//青海省[291,'上海']                                
cities[29] = [[291,'西宁市'], [291,'海东市'], [291,'西宁市'], [294,'海北藏族'], [295,'海南藏族'], [296,'黄南藏族'], [297,'果洛藏族'], [298,'玉树藏族'], [299,'海西蒙古']];
//宁夏自治区[301,'上海']                               
cities[30] = [[301,'银川市'], [302,'石嘴山市'], [303,'吴忠市'], [304,'固原市']];
//新疆自治区[311,'上海']
cities[31] = [[311,'乌鲁木齐市'], [312,'克拉玛依市'], [313,'自治区直辖行政单位'], [314,'喀什市'], [315,'阿克苏市'], [316,'和田市'], [317,'吐鲁番市'], [318,'哈密市'], [319,'克孜勒苏柯尔克孜'], [3110,'博尔塔拉蒙古自治州'], [3111,'昌吉回族自治州'], [3112,'巴音郭楞蒙古自治州'], [3113,'伊犁哈萨克自治州'], [3114,'伊犁市'], [3115,'塔城市'], [3116,'阿勒泰市']];
//香港特别行政区
cities[32] = [[321,'香港特别行政区']];
//澳门特别行政区
cities[33] = [[331,'澳门特别行政区']];
//台湾省
cities[34] = [[341,'台湾省']];
